<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 //EN">
<html>

<!-- Mirrored from www.cirsovius.de/CPM/Projekte/BASELIB/BASELIB.html by HTTrack Website Copier/3.x [XR&CO'2014], Tue, 16 Aug 2016 11:11:16 GMT -->
<head>
<title>Library</title>
<meta name="description" content="CP/M Library">
<meta name="keywords" content="JOYCE, PCW, CP/M, Library">
<meta name="author" content="Werner Cirsovius">
</head>

<body background="../code.gif">

<div align="center">
<h1>Library</h1>

<table width="90%" border="1" cellpadding="5">
<tr><td bgcolor="#26D9FF">
Meine ersten Programmierversuche am JOYCE waren mit dem CP/M 2.2 Assembler ASM, weil ich damals nur von ihm ein Handbuch vorliegen hatte.
V&ouml;llig unbefriedigend war die Tatsache, dass beim ASM eine einzige Datei als Quelle vorliegen musste - bei l&auml;ngeren Programmen eine Strapaze!
Als ich dann Unterlagen &uuml;ber den RMAC bekam, wurde dies anders, weil es der RMAC erlaubte, verschiebbare .REL (relocatable, relozierbar) Dateien zu erzeugen, die sp&auml;ter dann mit einem Linker zu einer Datei zusammengef&uuml;gt werden konnten.
<br />
Der Vorteil ist also hier, dass vorab Programmteile (Module) assembliert werden k&ouml;nnen.
Diese k&ouml;nnen dann mit einem Hilfsprogramm (Librarian) in einer Bibliothek verwaltet werden.
Nach dem Assemblieren des Hauptprogrammes (das auch wieder aus einzelnen Moduln bestehen kann), wird dann der Linker angewiesen, aus der Bibliothek ben&ouml;tigte Module dazuzuladen.
<br />
Ich habe damals folgendes Entwicklungspaket verwendet:

<ul>
<li><b>Assembler</b>: Zun&auml;chst den <i>RMAC</i> von Digital Research, der zum Lieferumfang von CP/M PLUS geh&ouml;rte.
Danach den <i>M80</i> von Microsoft.
Zus&auml;tzlich zum RMAC, der lediglich die 8080-Mnemonics kannte, konnte nun auch in <a href="https://clrhome.org/table/">Z80-Mnemonic</a> programmiert werden.
Sp&auml;ter kam dann der <i>SLR</i>-Assembler, der sehr schnell war, allerdings nur Z80-Mnemonics erkannte.
<br />
Allen Assemblern gemein ist, dass sie das <a href="../Assembler/REL80/REL80FORMAT.html">Microsoft-REL-Format</a> (<a href="http://www.seasip.demon.co.uk/Cpm/rel.html">hier englisch</a>) unterst&uuml;tzen.
</li>
<li><b>Linker</b>: Hier kam f&uuml;r mich von vornherein nur <i>LINK</i> von Digital Research zum Einsatz.
Dieses Programm unterst&uuml;tzt die Generierung einer RSX-Datei und ansatzweise den Overlay-Mechanismus.
</li>
<li><b>Librarian</b>: Auch hier habe ich ein Produkt von Digital Research verwendet, n&auml;mlich <i>LIB</i>.
<i>LIB</i> unterst&uuml;tzt das indizierte REL-Format (IRL).
Das bedeutet, dass Bibliotheken schneller durchsucht werden.
Hier eine Beschreibung des <a href="../Assembler/REL80/IRLFORMAT.html">DR-IRL-Format</a> (<a href="http://www.seasip.demon.co.uk/Cpm/irl.html">hier englisch</a>).
</li>
<li><b>Debugger</b>: Es gibt einige komfortablere Debugger, aber auch hier habe ich ein Produkt von Digital Research berwendet, zuerst <i>SID</i>, sp&auml;ter dann <i>ZSID</i>.
<i>ZSID</i> hat die gleiche Funktionalit&auml;t wie <i>SID</i>, jedoch mit Unterst&uuml;tzung der Z80-Syntax.
Allerdings gab es anfangs Probleme mit dem Breakpoint - hier gab es Konflikte mit dem JOYCE-Interruptvektor.</li>
</ul>

<hr />

Da viele Definitionen in den Modulen (z.B. BDOS-Funktionen) immer wieder ben&ouml;tigt werden, habe ich ein Modul geschrieben, das z.B. mit dem Assembler-Befehl
<p></p>
<code style="margin-left:2cm">maclib <a href="LIBS/BASELIB-LIB.txt">baselib.lib</a></code>
<p></p>
in den Quelltext der Module eingef&uuml;gt werden sollte.
<p></p>
&Auml;hnliches gilt allgemein f&uuml;r die Assemblerprogrammierung. Auch hierf&uuml;r existiert eine solche Definitionsdatei:
<p></p>
<code style="margin-left:2cm">maclib <a href="LIBS/BASE80-LIB.txt">base80.lib</a></code>

<hr />

Einige Hinweise zur Bibliothek finden sich <a href="Hints.html">hier</a>.
Die aufgebaute Bibliothek besteht aus den folgenden Gruppen, deren Routinen <a href="ABC.html">hier</a> alphabetisch aufgef&uuml;hrt sind:

<p></p>

<div align="center">
<table border="1" cellpadding="5">
<tr>
  <td align="center" valign="top" bgcolor="#FFFF99"><a href="Zeichen.html">Das Arbeiten mit Zeichen</a></td>
  <td align="center" valign="top" bgcolor="#FFCC99"><a href="Disk.html">Das Arbeiten mit Dateien</a></td>
</tr>
<tr>
  <td align="center" valign="top" bgcolor="#FFCC66"><a href="Mathe.html">Das Arbeiten mit mathematischen Routinen</a></td>
  <td align="center" valign="top" bgcolor="#FBE1CA"><a href="Hochsprachen.html">Das Arbeiten mit Hochsprach-Routinen</a></td>
</tr>
<tr>
  <td align="center" valign="top" bgcolor="#EEEEF1"><a href="PullDown.html">Das Arbeiten mit Pull-Down-Routinen</a></td>
  <td align="center" valign="top" bgcolor="#C0C0C0"><a href="Verschieden.html">Verschiedenes</a></td>
</tr>
</table>
</div>

<p></p>

Bei der Gestaltung der Bibliothek ist es wichtig, auf eine bestimmte Reihenfolge zu achten.
Einige Hinweise dazu finden sich <a href="BASELIBrel.html">hier</a>

<!-- ############################################################ -->
<p></p>

Es gibt zwei weitere erw&auml;hnenswerte Bibliotheken, mit denen ich gearbeitet habe:

<div align="center">
<table border="1" cellpadding="5">
<tr><td align="left" valign="top" bgcolor="#FFCC99">
<ul>
<li>
<a href="../xLIBS/SYSLIB/V4libs.html"><b>SYSLIB</b></a> ist eine Sammlung von Routinen haupts&auml;chlich f&uuml;r das ZCPR-Umfeld.
(H&auml;tte ich SYSLIB schon gekannt, als ich meine Library geschrieben hatte, h&auml;tte ich es mir erspart, das Rad neu zu erfinden).
SYSLIB ist kompatibel zum Microsoft-REL-Format und besteht aus folgenden Modulen:

<ul>
<li><b>SYSLIB</b>: allgemeine Routinen
</li>
<li><b>Z3LIB</b>: ZCPR3 Routinen
</li>
<li><b>ZSLIB</b>: ZSDOS Clock Routinen
</li>
<li><b>VLIB</b>: Videoroutinen f&uuml;r ZCPR3-Systeme
</li>
<li><b>DSLIB</b>: Clock Routinen
</li>
</ul>

</li>
<li>
<a href="../xLIBS/ZSM/ZSM.html"><b>ZSMLIB</b></a> ist eine Sammlung von C &auml;hnlichen Routinen.
Leider ist ZSMLIB nicht kompatibel zum Microsoft-REL-Format.
Daf&uuml;r gibt es einen eigenen Assembler, Linker und Librarian.
Die Syntax des Assemblers ist allerdings anders als die des M80, do dass die Quellen ebenfalls nicht kompatibel sind.
</li>
</ul>
</td></tr>
</table>
</div>
<!-- ############################################################ -->

</td></tr></table>
</div>

</body>


<!-- Mirrored from www.cirsovius.de/CPM/Projekte/BASELIB/BASELIB.html by HTTrack Website Copier/3.x [XR&CO'2014], Tue, 16 Aug 2016 11:11:16 GMT -->
</html>

